STMicroelectronics/STM32CubeH7/Projects/STM32H7B3I-EVAL/Demonstrations/STemWin/Gui/Target/LCDConf.c
  /* Set up custom color conversion using DMA2D, works only for direct color modes because of missing LUT for DMA2D destination */

  /* Set up custom bulk color conversion using DMA2D for ARGB1555 */
  GUICC_M1555I_SetCustColorConv(_Color2IndexBulk_M1555I_DMA2D, _Index2ColorBulk_M1555I_DMA2D);

  /* Set up custom bulk color conversion using DMA2D for RGB565 */
  GUICC_M565_SetCustColorConv  (_Color2IndexBulk_M565_DMA2D,   _Index2ColorBulk_M565_DMA2D);

  /* Set up custom bulk color conversion using DMA2D for ARGB4444 */
  GUICC_M4444I_SetCustColorConv(_Color2IndexBulk_M4444I_DMA2D, _Index2ColorBulk_M4444I_DMA2D);

  /* Set up custom bulk color conversion using DMA2D for RGB888 */
  GUICC_M888_SetCustColorConv  (_Color2IndexBulk_M888_DMA2D,   _Index2ColorBulk_M888_DMA2D);

  /* Set up custom bulk color conversion using DMA2D for ARGB8888 */
  GUICC_M8888I_SetCustColorConv(_Color2IndexBulk_M8888I_DMA2D, _Index2ColorBulk_M8888I_DMA2D);

#if defined (DMA2D_ALPHA_BLENDING)
  /* Set up custom alpha blending function using DMA2D */
  GUI_SetFuncAlphaBlending(_DMA_AlphaBlending);
#endif /* DMA2D_ALPHA_BLENDING */

  /* Set up custom function for translating a bitmap palette into index values.
   * Required to load a bitmap palette into DMA2D CLUT in case of a 8bpp indexed bitmap
   */
  GUI_SetFuncGetpPalConvTable(_LCD_GetpPalConvTable);

  /* Set up custom function for mixing up arrays of colors using DMA2D */
  GUI_SetFuncMixColorsBulk(_LCD_MixColorsBulk);

#if GUI_SUPPORT_MEMDEV
  /* Set up custom function for drawing 16bpp memory devices */
  GUI_MEMDEV_SetDrawMemdev16bppFunc(_LCD_DrawMemdev16bpp);

  /* Set up custom function for Alpha drawing operations */
  GUI_SetFuncDrawAlpha(_LCD_DrawMemdevAlpha, _LCD_DrawBitmapAlpha);
#endif

  /* Create the semaphore that will be used for the GUI thread */
  osSemaphoreDef( LcdUpdateSemaphore );
  LcdUpdateSemaphoreId = osSemaphoreCreate( osSemaphore( LcdUpdateSemaphore ), 1 );
  osSemaphoreWait(LcdUpdateSemaphoreId , osWaitForever);

  /* Create the Semaphore used by the two threads */
  /* Create Semaphore lock */
  osSemaphoreDef(Semaphore);
  osDma2dSemph = osSemaphoreCreate(osSemaphore(Semaphore), 1);
  osSemaphoreWait(osDma2dSemph, osWaitForever); /* next call to osSemaphoreWait will block */
  osMutexDef(DeviceMutex);
  osDeviceMutex = osMutexCreate(osMutex(DeviceMutex));

  /* Complete the initialisation */
  LCD_LL_Init ();

  LCD_LL_LayerInit(0, LCD_GetBufferAddress(0, 0));
  HAL_LTDC_SetPitch(&hltdc, XSIZE_PHYS, 0);
  LCD_SetBufferPtrEx(0, (U32 *)Framebuffers[0]);

#if (GUI_NUM_LAYERS > 1)
  LCD_LL_LayerInit(1, LCD_GetBufferAddress(1, 0));
  HAL_LTDC_SetPitch(&hltdc, XSIZE_PHYS, 1);
  LCD_SetBufferPtrEx(1, (U32 *)Framebuffers[1]);
#endif

  HAL_Delay(20);
}

/*********************************************************************
*
*       CopyBuffer
*/
void DMA2D_CopyBufferWithAlpha_filter(const uint16_t xSize, const uint16_t ySize, void * pSrc, void * pDst)
{
  osMutexWait(osDeviceMutex, osWaitForever);

  DMA2D->CR      = 0x00010000UL | (1 << 9) | (1 << 8);

  /* Set up pointers */
  DMA2D->FGMAR   = (U32)pSrc;
  DMA2D->OMAR    = (U32)pDst;
  DMA2D->BGMAR   = (U32)pDst;
  DMA2D->FGOR    = 0;
  DMA2D->OOR     = 0;
  DMA2D->BGOR    = 0;

  /* Set up pixel format */
  DMA2D->FGPFCCR  = DMA2D_INPUT_ARGB8888;
  DMA2D->FGPFCCR |= DMA2D_FGPFCCR_AM_0;
  DMA2D->OPFCCR   = DMA2D_OUTPUT_ARGB8888;
  DMA2D->OPFCCR  |= DMA2D_OPFCCR_RBS;
  DMA2D->OPFCCR  |= DMA2D_OPFCCR_AI;

  /* Set up size */
  DMA2D->NLR      = (U32)(xSize << 16) | (U16)ySize;

  /* Start transfer */
  DMA2D->CR |= DMA2D_CR_START;

  _DMA2D_ExecOperation();

  osMutexRelease(osDeviceMutex);
}

void LCD_LL_DrawBitmap32bpp_filter(U8 const * p)
{
  U32 AddrDst;

  AddrDst = LCD_GetBufferAddress(0, _aBufferIndex[0]);
  DMA2D_CopyBufferWithAlpha_filter(XSIZE_PHYS, YSIZE_PHYS, (void *)AddrDst, (void *)p);
}

/**
  * @brief  Draw 16 bits per pixel bitmap
  * @param  LayerIndex  : Layer index
  * @param  x           : start horizontal position on the screen
  * @param  y           : start vertical position on the screen
  * @param  p           : Source buffer
  * @param  xSize       : Horizontal bitmap size
  * @param  ySize       : Vertical bitmap size
  * @param  BytesPerLine: Number of bytes per Line
  * @retval None
  */
void _LCD_DrawBitmap16bpp(int LayerIndex, int x, int y, U16 const * p, int xSize, int ySize, int BytesPerLine)
{
  U32 AddrDst;
  int OffLineSrc, OffLineDst;

  AddrDst  = LCD_GetBufferAddress(LayerIndex, _aBufferIndex[LayerIndex]);
  AddrDst += ((y * _axSize[LayerIndex] + x) * _aBytesPerPixels[LayerIndex]);
  OffLineSrc = (BytesPerLine / 2) - xSize;
  OffLineDst = _axSize[LayerIndex] - xSize;
  _DMA_Copy(LayerIndex, (void *)p, (void *)AddrDst, xSize, ySize, OffLineSrc, OffLineDst);  
}

static U32 _GetBitmapPixelformat(const void *pDst)
{
  U32 format;
  const GUI_BITMAP *bitmap = (GUI_BITMAP *)pDst;

  switch(bitmap->BitsPerPixel)
  {
    case 16:
      format = DMA2D_OUTPUT_RGB565;
    break;
    case 24:
      format = DMA2D_OUTPUT_RGB888;
    break;
    default :
    case 32:
      format = DMA2D_OUTPUT_ARGB8888;
    break;
  }

  return format;
}

static U32 _GetBitmapDataAddress(const void *pDst)
{
  const GUI_BITMAP *bitmap = (GUI_BITMAP *)pDst;

  return (U32 )bitmap->pData;
}

/**
  * @brief  DMA2D conversion from YCbCr (video output) to RGB (Display frame buffer)
  * @param  LayerIndex : LCD Layer Index
  * @param  pSrc : Source buffer pointer
  * @param  pDst : Destination buffer pointer
  * @param  xSize: Horizontal size of the frame buffer
  * @param  ySize: Vertical size of the frame buffer
  * @param  aCssMode: CSS Mode
  * @retval None
  */
void DMA2D_CopyBuffer_YCbCr_To_RGB(int LayerIndex, const void * pSrc, const void * pDst, int xSize, int ySize, int aCssMode)
{
  uint32_t inputLineOffset = 0;
  U32 regValue, regMask;
  U32 Destination, PixelFormat;

  if(pDst)
  {
    Destination = _GetBitmapDataAddress(pDst);
    PixelFormat = _GetBitmapPixelformat(pDst);
  }
  else
  {
    Destination = LCD_GetBufferAddress(LayerIndex, _aBufferIndex[LayerIndex]);
    PixelFormat = _GetPixelformat(LayerIndex);
  }

  switch (aCssMode)
  {
    case DMA2D_CSS_420 :
    case DMA2D_CSS_422 :  
      inputLineOffset = xSize % 16;
      if(inputLineOffset != 0)
      {
        inputLineOffset = 16 - inputLineOffset;
      }
    break;
    case DMA2D_NO_CSS :
    default :  
      inputLineOffset = xSize % 8;
      if(inputLineOffset != 0)
      {
        inputLineOffset = 8 - inputLineOffset;
      }
    break;
  }

  regValue = DMA2D_INPUT_YCBCR | (DMA2D_REPLACE_ALPHA << 16) \
           | (DMA2D_REGULAR_ALPHA << 20) | (DMA2D_RB_REGULAR << 21) \
           | (0xFFU << 24) | (aCssMode << 18);

  regMask  = DMA2D_BGPFCCR_CM | DMA2D_BGPFCCR_AM | DMA2D_BGPFCCR_ALPHA | DMA2D_BGPFCCR_AI | DMA2D_BGPFCCR_RBS | DMA2D_FGPFCCR_CSS;

  osMutexWait(osDeviceMutex, osWaitForever);

  /* Setup DMA2D Configuration */
  DMA2D->CR      = 0x00010000UL | (1 << 9) | (1 << 8);
  DMA2D->OPFCCR  = PixelFormat;
  DMA2D->OOR     = 0;
  DMA2D->OPFCCR  |= (DMA2D_REGULAR_ALPHA << 20);
  DMA2D->OPFCCR  |= (DMA2D_RB_REGULAR << 21);
  DMA2D->FGPFCCR = (regMask & regValue);
  DMA2D->FGOR    = inputLineOffset;
  DMA2D->NLR     = (U32)(xSize << 16) | (U16)ySize;
  DMA2D->OMAR    = Destination;
  DMA2D->FGMAR   = (U32)pSrc;

  /* Start the transfer, and enable the transfer complete IT */
  DMA2D->CR |= DMA2D_CR_START;

  /* Wait for the end of the transfer */
  _DMA2D_ExecOperation();

  osMutexRelease(osDeviceMutex);
}


